package ch10;

// 세 과목의 총점과 평균을 계산하는 메서드를 작성하고 이를 출력하는 프로그램을 작성하세요.
public class MethodProb {
    // int[] 점수 배열을 전달받아서 총점을 계산해서 반환하는 메서드(sum)

    // int[] 점수 배열을 전달받아서 평균을 계산해서 반환하는 메서드(avg)
    // 평균은 소수도 표현해야 함

    // int[] 점수 배열을 전달 받아서 총점, 평균을 출력하는 메서드(printScore)
    // 출력 예시:
    // 총점: 268, 평균: 89.4

    void main(){
        // haru는 국어, 영어, 수학 점수가 각각 80, 70, 56이다.
        // namu는 국어, 영어, 수학 점수가 각각 90, 77, 80이다.
        // brong이는 국어, 영어, 수학 점수가 각각 100, 99, 88이다.

        // 이 셋의 총점과 평균을 구해서 출력하세요.

        int[] haruScore = {80, 70, 56};

        // 최종 출력 결과
        // 총점: 217, 평균: 72.33333
        // 총점: 247, 평균: 82.33333
        // 총점: 287, 평균: 95.66666

        // 전체 총점: 732, 전체 평균: 81.33333

    }
}
